Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>ariVCt7Jt5QiKZ6ZI2Wg2gor81+rMW2UIkcQ4fM1qAq2mBbjNSh6wWTV0KbjIgVttDFs25jHe20v&#13;
E3GXhMpvN4O5toSsgJnOuNgKBM5d76BWgTO35dV3u5wJHvZNWBJhEeK2UWzs2wCu4KF5gBVzyAfU&#13;
OLV4aqKjlqNDsslYKALkLsXCRkwJywM0wZgS3Bg+VSuAotm649uvBlnZUhxJ8B9BTx3zfhLwsLBk&#13;
425E8VYAva0MphiB9HG9aOfIh9deuD6cs+wOdDs01ZeqYeKCqNctvLEGbH55oTyYEe6RPw/4aAR2&#13;
0dhSKHEUuHx9maUIy7OsrnT5fKddM1UHnz/HyQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>0XG4JwhD08zNr0di677YvQAw+p43uMJ+/Ghw849mFNaWnswCWTzbsoFJLLV17WozttCdl+OU1vc5&#13;
HEvt/5fz9jTfDNfowSV0hpPtC4Tc2EVFH1kgjB/Z2Cq7QJqHCPSNh+fSetuU4am5fDCsmAGjhsGd&#13;
pp98icIxp87aiA8Onq3WXbtKQMJubt8qaXusI2LQDHo1AxAtrk/RuXe7rGtlOBeUi4EPo6Nt2odH&#13;
ZTp1NuUPIbWL+wtW5RTTlcy36ubfgVL6tnO5cRv2QI8CkUySfAQilcqJq+3KITb6KAVEdQRFakjJ&#13;
24Irr3BAq8N5tV6LeP/FHQdOdYKbQrts7UgZapNyXinU6CS8tvPEnCuvATW+3b3+45i8jOMA7uMd&#13;
XuuGenTt7b7uKE3pzD2ihE5GA/IbYyD532WqSqtEH6cHHf1WcuH/pAuKbzn+LK+0z3ktmXr/noe0&#13;
3J/sygEHDHCbRQaZ3Gf901cyiC+UXVLygnHZ6jF8Z1MM4Fa1tXPKIWwHUQvgg5vYqbgo0ZQikbk9&#13;
gMlE5NnGeSUFYdwad7+1e5BUtShLvwmPK2Gc7tsPD0m/Vn8bJ+Chu82u5G+y4fg0JaXFn3H5wSj0&#13;
naEMF4oXH8Qgou6oYR3HNBWBy0WNsSfmJBlR+21xTn4ynqPXs9msXXv6ZUTY7GvJGG0HMVQcZhNw&#13;
5Su7OUmM5BzANpW7T7pzC1OLJIG2ebP5d9LzidvGGXY+7+NXGFJ8NtXrzSCnQq0cvfKBgXDIK8Dj&#13;
AwIFA3CvreEzPm5PSU9f+vloxyGvmTLI+c4TB/hFMyYPLZ4VmTG3ri0Lkvqqb7Xr4RaH4euMeoi2&#13;
QiXqRmQwaZFq6wLLRkzHbfgvD4xPoBJzGAOmyjz+e+itBJrTUfl6qVqRWTFiVkKYIFzF9XNp6ndU&#13;
cVdCQyh+whjG6PaI5yxA0TDsFcFGPvaJpwKYfsO72TffhrWzQ2MFihwk6EOx+lzhowxYS3bE4VK2&#13;
Q1bU</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>BH3vyz9yPoSuxRVwUJhoZTWgA0s=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
Fx4iv2KVdbP7mTxp9+ZXd6lGjoID+N75CRsJ769oxvlRVSrPdlY4KlTrqPEIZJPJ1YBjGqme6Ke2&#13;
PBGwL8Un7gEj4DlJu6r/Ww+Er1tj4Tx1WIA4pkxiDX2fKdwzg2S+s00vevgEt23iUUMCKVyQdMuQ&#13;
+nRCIP9g1MDITjcZtvSlD0DCxrl3+Ogf7Ov+Z9623X47sdIpbxjI2Dkbz9y4Obz8UfWViqqe7GfK&#13;
13GL+CqMAOTwMlL9bjP0+zRLSgGEvE/DcKvNHpwONCMr+INmjDK8yI0k7F3fuAaRLERAWrDLMgFJ&#13;
03Q36A9dGp/vu1zYbn7hTuK7RlgYGz/k5+dYmw==
</ds:SignatureValue>
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>